public/man/man1/named-rrchecker.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - named-rrchecker.1 | Technical Notes</title>

    <link rel="stylesheet" href="/css/main.css">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - named-rrchecker.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>named-rrchecker - syntax checker for individual DNS resource records</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p><strong>named-rrchecker</strong> [*-h*] [*-o* origin] [*-p*] [*-u*] [*-C*] [*-T*]
[*-P*]</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p><strong>named-rrchecker</strong> reads a individual DNS resource record from standard
input and checks whether it is syntactically correct.</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
OPTIONS
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<blockquote>
<dl>
<dt>
<strong>-h</strong>
</dt>
<dd>This option prints out the help menu.</dd>
</dl>
</blockquote>
<blockquote>
<dl>
<dt>
<strong>-o origin</strong>
</dt>
<dd>This option specifies the origin to be used when
interpreting the record.</dd>
</dl>
</blockquote>
<blockquote>
<dl>
<dt>
<strong>-p</strong>
</dt>
<dd>This option prints out the resulting record in canonical form.
If there is no canonical form defined, the record is printed in
unknown record format.</dd>
</dl>
</blockquote>
<blockquote>
<dl>
<dt>
<strong>-u</strong>
</dt>
<dd>This option prints out the resulting record in unknown record
form.</dd>
</dl>
</blockquote>
<blockquote>
<dl>
<dt>
<strong>-C, -T, -P</strong>
</dt>
<dd>These options print out the known class, standard
type, and private type mnemonics, respectively.</dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
SEE ALSO
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p><em>RFC 1034</em>, <em>RFC 1035</em>, <em>named(8)</em>.</p>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
AUTHOR
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p>Internet Systems Consortium</p>
</div>
</div>
<div id="outline-container-headline-7" class="outline-2">
<h2 id="headline-7">
COPYRIGHT
</h2>
<div id="outline-text-headline-7" class="outline-text-2">
<p>2024, Internet Systems Consortium</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.js"></script>
    </body>
</html>
